 gcc -g p7final.c
 ./a.out
Input a fraction 
3
4
Input a fraction 
5
4
 the sum of two fractions is 3/4 and 54 is 21 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x8a7: file p7final.c, line 43.
(gdb) r
Starting program: /home/runner/Test3Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7final.c:43
43    f1=input_fraction();
(gdb) n
Input a fraction 
4
6
44    f2=input_fraction();
(gdb) n
Input a fraction 
6
8
45    sum=add_fraction(f1,f2);
(gdb) s
add_fraction (f1=..., f2=...) at p7final.c:28
28    sum.num=f1.num*f2.den+f2.num*f1.den;
(gdb) p f1
$1 = {num = 4, den = 6}
(gdb) p f2
$2 = {num = 6, den = 8}
(gdb) p sum
$3 = {num = 241759744, den = 1238138717}
(gdb) n
29    sum.den=f1.den*f2.den;
(gdb) n
30    int g=gcd(sum.num,sum.den);
(gdb) n
31    sum.num=sum.num/g;
(gdb) n
32    sum.den=sum.den/g;
(gdb) n
33    return sum;
(gdb) n
35  }
(gdb) n
main () at p7final.c:46
46    output(f1,f2,sum);
(gdb) n
47    return 0;
(gdb) n
